package com.example.azkeral_moslam;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class pray extends AppCompatActivity {
RecyclerView recy;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_pray);
        recy  = findViewById(R.id.pray);
        ArrayList<imageazker> image = new ArrayList<>();
        ArrayList<String> azker   = new ArrayList<>();
        image.add(new imageazker(R.drawable.charr," قَالَ رَسُولُ اللَّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم-: «مَنْ قَرَأَ آيَةَ الْكُرْسِيِّ فِي دُبُرِ كُلِّ صَلاةٍ مَكْتُوبَةٍ لَمْ يَمْنَعْهُ مِنْ دُخُولِ الْجَنَّةِ إِلا أَنْ يَمُوتَ »،"));
        image.add(new imageazker(R.drawable.almaostan,"وعن عُقبةَ بنِ عامرٍ- رضي الله عنه-، قالَ: أمرَني رسولُ اللَّهِ -صلَّى اللَّهُ علَيهِ وسلَّمَ- أن أقرأَ بالمعوِّذاتِ دُبُرَ كلِّ صلاةٍ المعوذات: وهي سورة الإخلاص والفلق والناس»، رواه أبو داود وصححه الألباني.\n" +
                "يذكر أنه تقرأ المعوذات بعد كل صلاة مرة إلا الفجر والمغرب ثلاث مرات، واستدل العلماء لذلك بحديث عبد الله بن خبيب - رضي الله عنه- أن النبي- صلى الله عليه وسلم- قال له«:قل هو الله أحد والمعوذتين حين تمسي وتصبح ثلاث مرات تكفيك من كل شيء». "));
        azker.add("«كان رَسُولُ اللَّهِ- صَلّى اللهُ عَلَيْهِ وسَلَّم- إذا انْصَرَف مِنْ صلاتِهِ اسْتَغفَر ثَلاثًا، وقال: \" اللَّهُمَّ أَنْتَ السَّلامُ، ومِنكَ السَّلامُ، تباركْتَ يَا ذا الجلالِ والإكرام»،قِيل للأَوْزاعي - رحمه الله- وهُوَ أَحَد رُواةِ الحديث: كيفَ الاستِغفَارُ؟ قال: تقول:(أَسْتَغْفرُ اللَّه، أَسْتَغْفِرُ اللَّه)، رواهُ مسلم ");
azker.add("عَن المُغِيرةِ بن شُعْبةَ - رضي اللَّه عَنْهُ- أنَّ رَسُول اللَّه - صَلّى اللهُ عَلَيْهِ وسَلَّم - كَان إذا فَرغَ مِنَ الصَّلاة وسلَّم قالَ: «لا إلهَ إلاَّ اللَّه وحْدَهُ لا شَرِيكَ لَهُ، لهُ المُلْكُ ولَهُ الحَمْدُ، وهُوَ عَلى كُلِّ شَيءٍ قَديرٌ. اللَّهُمَّ لا مانِعَ لما أعْطَيْتَ، وَلا مُعْطيَ لما مَنَعْتَ، ولا ينْفَعُ ذا الجَدِّ مِنْكَ الجدُّ »، متفقٌ عليه.");
azker.add("عن عبد اللَّه بن الزُّبَيْرِ- رضي اللَّه تعالى عنْهُما- « أنه – صلى الله عليه وسلم- أَ كان يقُول دُبُرَ كَلِّ صلاةٍ، حينَ يُسَلِّمُ: لا إلَه إلاَّ اللَّه وَحْدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْدُ، وهُوَ عَلى كُلِّ شيءٍ قَديرٌ. لا حوْلَ وَلا قُوَّةَ إلاَّ بِاللَّه، لا إله إلاَّ اللَّه، وَلا نَعْبُدُ إلاَّ إيَّاهُ، لهُ النعمةُ ولَهُ الفضْلُ وَلَهُ الثَّنَاءُ الحَسنُ، لا إله إلاَّ اللَّه مُخْلِصِينَ لَهُ الدِّينَ ولوْ كَرِه الكَافرُون».");
azker.add("عنْ سعدِ بن أبي وقاص – رضى الله عنْهُ- «أنَّ رَسُول اللَّه - صلى الله عليه وسلم- كانَ يَتَعوَّذُ دُبُر الصَّلَواتِ بِهؤلاءِ الكلِمات: اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ الجُبْنِ والْبُخلِ وَأَعوذُ بِكَ مِنْ أنْ أُرَدَّ إلى أرْذَل العُمُرِ وَأعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيا وأَعوذُ بِكَ مِنْ فِتْنَةِ القَبر»، رواه البخاري");
    azker.add("عَنْ مُعَاذِ بْنِ جَبَلٍ- رضي الله عنه- أَنَّ رَسُولَ اللَّهِ -صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ- أَخَذَ بِيَدِهِ، وَقَالَ:«يَا مُعَاذُ، وَاللَّهِ إِنِّي لَأُحِبُّكَ، وَاللَّهِ إِنِّي لَأُحِبُّكَ، فَقَالَ: أُوصِيكَ يَا مُعَاذُ لَا تَدَعَنَّ فِي دُبُرِ كُلِّ صَلَاةٍ تَقُولُ: اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ »، رواه أبو داود وصححه الألباني .");
azker.add("سُبْحَانَ اللَّهِ (33 مرة)");
    azker.add("الْحَمْدُ لِلَّهِ (33 مرة)");
    azker.add("اللَّهُ أَكْبَرُ (34 مرة)");
    azker.forEach(s -> image.add(new imageazker(-1,s)));
    AzkarListAdapter azkeradeptetr = new AzkarListAdapter(image);
        RecyclerView.LayoutManager im = new LinearLayoutManager(this);
        recy.setLayoutManager(im);
recy.setAdapter(azkeradeptetr);
recy.setHasFixedSize(true);

    }
}